# Temporary Graphics Manager Class

Source: https://www.revitapidocs.com/2026/1dd29f70-d381-fa60-8ffa-1076eac55ed7.htm

---

| Temporary Graphics Manager Class |
| --- |

A class that provides functionality to create temporary graphics in a Revit model. Inheritance Hierarchy System Object
Autodesk.Revit.DB TemporaryGraphicsManager

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class TemporaryGraphicsManager : IDisposable
```

```
Public Class TemporaryGraphicsManager
	Implements IDisposable
```

```
public ref class TemporaryGraphicsManager : IDisposable
```

```
type TemporaryGraphicsManager =
    class
        interface IDisposable
    end
```
The TemporaryGraphicsManager type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | AddControl | Creates an in\-canvas control. |
|  | Clear | Clear all temporary graphics objects managed by this manager. |
|  | Dispose | Releases all resources used by the TemporaryGraphicsManager |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetAll | Returns all temporary graphics object indexes managed by this manager. |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetTemporaryGraphicsManager | Gets a TemporaryGraphicsManager reference of the document. |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | RemoveControl | Deletes the existing control identified by the unique index. |
|  | SetTooltip | Sets the tooltip for the temporary graphics object. |
|  | SetVisibility | Changes the visibility of temporary graphics object. |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |
|  | UpdateControl | Updates the in\-canvas control identified by the unique index. |

Top Remarks The graphics created by this class are temporary or transient. They are not subject to undo and are not saved. It's caller's
 responsiblity to manage their lifetime, creation and destruction, though Revit will destroy all of them when closing the model.

See Also

#### Reference

Autodesk.Revit.DB Namespace